early-init.org
#+title: early-init.org
#+description: Kyure_A's Emacs config
#+author: Kyure_A
 
* Introduction

** Author
Kyure_A

** Repository
https://github.com/Kyure-A/.emacs.d

** Initialize
*** Header
#+begin_src emacs-lisp 
  ;;; early-init.el ---  -*- lexical-binding: t -*-

  ;; Author: Kyure_A <github.com/Kyure-A>
  ;; Maintainer: Kyure_A <github.com/Kyure-A>

  ;;; Commentary:

  ;;              .mmmmmmmmmmmmmm.                   .cccccccc!                .(.
  ;;  .+eeeee.   .??:   +m<   <mm.    .aaaaaaaa.    ccC!           .+sssss{    (!!
  ;; .ee:        .mm:   +mm   .mm_   .aa>   (aaA    cCC           .ss>         1!:
  ;; .ee_        .mm:   +mm   .mm_   .aa{    aaA    ccC           .sss.        !!
  ;; .ee_ <ee    .mm:   +mm   .mm_   .aa{ .(AaaA    cCC`           .<sssss    .!:
  ;; .ee_        .mm:   +mm   .mm_   .aa{ .??aaA    cCCc......         .ss:   ..
  ;; .eee....    .<<!   ?<<   .<<`   .aa{    aaA     ?CCCCCCC!    ....(s=: .!!-
  ;;  .?eeeee`                       .AA!    AAA                  .ssss<s!   .!!

  ;;; Code:  
#+end_src

*** profiler
#+begin_src emacs-lisp :tangle no
  (require 'profiler)
  (profiler-start 'cpu)
#+end_src

*** native comp
#+begin_src emacs-lisp
  (let* ((base (expand-file-name "eln-cache/" user-emacs-directory))
         (abi  (format "%s-%s/" emacs-version (comp-abi-hash)))
         (dir  (expand-file-name abi base)))
    ;; Ensure the ABI-specific eln dir is searched first.
    (add-to-list 'native-comp-eln-load-path dir)
    (add-to-list 'native-comp-eln-load-path base t))
  (custom-set-variables '(warning-suppress-types '((comp))))
  (with-eval-after-load 'comp
    (setq native-comp-async-jobs-number 8)
    (setq native-comp-speed 3)
    (setq native-comp-verbose 2)
    (setq native-comp-always-compile t)
    (setq native-comp-jit-compilation-deny-list '(".*-loaddefs.el.gz")))
#+end_src

*** Suppress auto package loading
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

*** Decrease GC
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 512 1024 1024))
#+end_src

*** other
#+begin_src emacs-lisp
  (defun display-startup-echo-area-message ())
  (setq inhibit-startup-message t)
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil)
  (setq inhibit-startup-buffer-menu t)
  (setq message-log-max 1000)
  (setq ring-bell-function 'ignore)
  (setq default-directory "~/")
  (setq command-line-default-directory "~/")
#+end_src

*** nano-emacs like style
[[https://github.com/rougier/nano-emacs/blob/b8631088220dbbcd885ad1353bdc52b569655f85/nano-layout.el#L21][Source]]
and disable scroll-bar, tool-bar and menu-bar.
#+begin_src emacs-lisp
  (push '(min-height . 1) default-frame-alist)
  (push '(min-width . 1) default-frame-alist)
  (push '(height . 45) default-frame-alist)
  (push '(width . 81) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
  (push '(internal-border-width . 24) default-frame-alist)
  (push '(left-fringe . 1) default-frame-alist)
  (push '(right-fringe . 1) default-frame-alist)
  (push '(fullscreen . maximized) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(menu-bar-lines . 0) default-frame-alist)
#+end_src

*** suppress window resize
#+begin_src emacs-lisp
  (setq frame-inhibit-implied-resize t)
#+end_src

*** suppress warning
#+begin_src emacs-lisp
  (setq display-warning-minimum-level :error)
#+end_src

*** User Info
#+begin_src emacs-lisp 
  (setq user-full-name "Kyure_A")
  (setq user-mail-address "49436968+Kyure-A@users.noreply.github.com")
#+end_src

*** Disable Magic File Name at startup
#+begin_src emacs-lisp
  (defconst init/saved-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src

*** System Language Setting
#+begin_src emacs-lisp 
  (set-language-environment "Japanese")
  (prefer-coding-system 'utf-8)
  (set-default 'buffer-file-coding-system 'utf-8)
#+end_src

*** load custom.el
#+begin_src emacs-lisp
  (setq custom-file (locate-user-emacs-file "custom.el"))
#+end_src

*** debug-on-error
#+begin_src emacs-lisp
  (setq debug-on-error t)
#+end_src
